
// ###########################################################################################################################################################

// // ==========================================Task-1

// Як оголосити змінну, значення якої не можна буде змінити пізніше?

// const name = 'Eva';          V

// let name = 'Eva';

// final name = 'Eva';

// real name = 'Eva';


// ###########################################################################################################################################################

// // ==========================================Task-2

// Як оголосити змінну, значення якої можна буде змінити пізніше ?

// const age = 20;


// let age = 20;           V


// real age = 20;


// final age = 20;

// ###########################################################################################################################################################

// // ==========================================Task-3

// Як відобразити повідомлення 'Hello world' у консолі DevTools ?

// console.log('Hello world');         V


// console.write(Hello world);


// console.log(Hello world);


// console.write('Hello world');

// ###########################################################################################################################################################

// // ==========================================Task-4

// Як правильно додати однорядковий коментар ?

// /* code...


// / code... /


// \\ code....


// // code...          V

// ###########################################################################################################################################################

// // ==========================================Task-5

// // --------------------===================== Сonditions --------------------=====================

// Коментарі - важлива складова роботи з кодом для кожного розробника.

// Перед тобою закоментований код.

// Розкоментуй його, видаливши символи //.

// //const name = 'Alice';

// //const age = 28;

// //--------------------===================== Result --------------------=====================

// const name = 'Alice';

// const age = 28;

// ###########################################################################################################################################################

// // ==========================================Task-6

// // --------------------===================== Сonditions --------------------=====================

// Тепер потренуємось закоментовувати наш код.

// Закоментуй const age і const name, використовуючи однорядкові коментарі (//).

//     Приклад:

// // const name = 'Bob';

// //--------------------===================== Result --------------------=====================

// const name = 'Bob';

// const age = 37;

// ###########################################################################################################################################################

// // ==========================================Task-7

// // --------------------===================== Сonditions --------------------=====================

// Метод console.log виводить дані в консоль.

// Давай виведемо значення змінної greeting в консоль.Для цього помісти змінну greeting у круглі дужки в методі console.log().

//     Приклад:

// const variable = 123;
// console.log(variable);

// // В консолі виведеться 123
// Підказка: значення, надруковані за допомогою console.log, доступні в блоці Дивитись логи кожного тесту в результатах.

// //--------------------===================== Result --------------------=====================

// const greeting = 'Hello, world!';

// console.log(greeting);

// ###########################################################################################################################################################

// // ==========================================Task-8

// // --------------------===================== Сonditions --------------------=====================

// Код, написаний в редакторі, не працює.Виправ оголошення змінної, щоб він запрацював.

//     Підказка
// Заміни const на let в оголошенні змінної, щоб її значення можна було змінити.

// fix the mistake

// const books = 5;

// books = 7;

// //--------------------===================== Result --------------------=====================

// fix the mistake

// let books = 5;

// books = 7;

// ###########################################################################################################################################################

// // ==========================================Task-9

// // --------------------===================== Сonditions --------------------=====================

// Давай зробимо фруктовий сік!

// Ми маємо 4 кг яблук і 3 кг груш, тому твоє завдання - оголосити три змінні:

// змінну apples зі значенням 4;
// змінну pears зі значенням 3;
// змінну fruits з сумою змінних apples та pears.
//     Примітка: змінні мають бути названі так, як вказано у завданні!

// Приклад:

// const apples = 4;

// //--------------------===================== Result --------------------=====================

// declare variables with correct values
// const apples = 4;
// const pears = 3;
// const fruits = apples + pears;