// Основні поняття
// Зазвичай комп'ютерна програма - це текстовий файл, написаний на якійсь мові програмування. Для того, щоб комп'ютер зрозумів, що ми від нього хочемо, ми повинні слідувати відповідним правилам цієї мови програмування.

//     Команди
// Програми в Javascript складаються з команд.В кінці команди ми ставимо;, щоб комп'ютер точно знав, де закінчується команда.

// Наприклад, існує метод console.log(), який використовується для виведення повідомлень в консоль.Ця команда виведе в консоль Hello, world!:

// console.log('Hello, world!');
// Коментарі
// Коментар - це пояснювальний текст, що не виконується комп'ютером, а просто допомагає програмісту краще зрозуміти, як працює програма. Він починається з // і продовжується до кінця рядка.

// // Друкуємо в консолі фразу 'Hello, world!'
// console.log('Hello, world!');
// Літерали
// Зазвичай програми працюють з даними.Це можуть бути, наприклад, якісь числа або текст.Для запису даних в програмі використовують літерали.

// Числа складаються з цифр і пишуться без лапок(42, -5, 1000000)
// Рядки пишуться в лапках('Misha', 'Hello, world!', "It's a wonderful world")
// Змінні
// Для зберігання даних використовуються змінні.По суті це коробка з назвою, в яку ми кладемо якісь дані.Щоб записати в змінну значення, ми використовуємо оператор =.Є два типи змінних: змінювані(оголошені з let) и незмінні(оголошені з const).

//     // Цій змінній пізніше можна присвоїти інше значення
//     let age = 37;

// age = 38;
// console.log(age); // ми побачимо 38

// // Цій змінній присвоїти інше значення не вийде
// const name = 'Misha';

// name = 'Petya'; // видасть помилку
// Найменування змінних
// Назва змінної може складатися з англійських букв(великих і маленьких), цифр і символів _ та $, але не може починатися з цифри.Якщо в назві буде кілька слів, то ми пишемо їх разом(без пробілів) і перше слово буде починатися з маленької літери, а інші з великої.

// // Хороша назва
// const cookiePrice = 15;

// // Погана назва
// const cookie_price = 15;
// Вирази
// Якщо нам потрібно обчислити якесь значення на основі даних(змінних або літералів), ми з'єднаємо їх операторами і отримаємо вираз. Щоб обчислити значення виразу, потрібно:

// підставити замість змінних їх значення
// провести всі обчислення.
// const cookiePrice = 15;

// console.log(20 - cookiePrice);
// // Спочатку замінимо cookiePrice на 15
// // отримаємо 20 - 15
// // результат 5
// // В консолі виведеться 5