// Рядки
// Рядки використовуютьcя для запису текстових даних.Їх можна записати в одинарних лапках('Misha', 'Hello, world!') і в зворотніх лапках, куди можна вставляти вирази і переноси рядків.Вставка змінних в рядок в зворотніх лапках називається інтерполяція.

// const a = 5;
// const b = 3;
// const name = 'Misha';

// const message = `
//   Hi, ${name}!
//   Welcom to the team.
//   a + b = ${a + b}
// `;

// // Замість змінних і виразів підставляться їхні значення
// console.log(message);
// Для рядків можна використовувати і подвійні лапки("Misha", "Hello, world!").Вони працюють так само, як одинарні, але на практиці їх зазвичай не використовують.

//     Конкатенація
// В Javascript рядки можна додавати один до одного та до даних інших типів - це називається конкатенація.В результаті конкатенації виходить новий рядок, "склеєний" з двох частин

// console.log('Hello,' + 'world!'); // 'Hello,world!'
// console.log('My age is ' + 12); // 'My age is 12'
// Порожній рядок
// Порожній рядок - це рядок, в якому немає жодного символу.Записується як ''(двоє лапок поспіль).Використовується, щоб поступово доповнювати значення змінної рядковими даними.

// let phrase = '';
// phare = phrase + 'Hello'; // 'Hello'
// phare = phrase + ', '; // 'Hello, '
// phare = phrase + 'World!'; // 'Hello, World!';