// ###########################################################################################################################################################

// // ==========================================Task-1

// Який тип у змінної ? const isMarried = false;

// boolean          V

// string

// undefined

// number

// ###########################################################################################################################################################

// // ==========================================Task-2

// Як дізнатися тип змінної 'a' ?

// a typeis

// typeof a            V

// type a

// getType a

// ###########################################################################################################################################################

// // ==========================================Task-3

// Який тип у змінної ? const age = 29;

// number          V

// string

// boolean

// undefined

// ###########################################################################################################################################################

// // ==========================================Task-4

// Який тип у змінної ? const name = 'Charlie';

// string          V

// undefined

// number

// boolean

// ###########################################################################################################################################################

// // ==========================================Task-5

// Який тип у змінної ? const tail = undefined;

// undefined           V

// string

// boolean

// number

// ###########################################################################################################################################################

// // ==========================================Task-6

// // --------------------===================== Сonditions --------------------=====================
// Ти вже знаєш, що є числа, строки, булеві типи даних і так далі.
// Тепер настав час використати весь цей арсенал знань(ну як арсенал, радше швейцарський ніж) і увірватися у світ програмування.

// Але перед цим, давай все ж попрактикуємося.Ти вже, напевно, помітив(-ла) у відео, що при оголошенні змінних, використовуються слова,
// які описують те, що зберігатиметься у змінній.Самому комп'ютеру абсолютно байдуже, як ти називатимеш свої змінні,
// ця залізяка все простить і все зрозуміє.А от для тебе та інших програмістів критично важливо, щоб код залишався зрозумілим і читабельним.

// Давай оголосимо кілька змінних з певними значеннями всередині:

// змінну brand зі значенням 'Toyota'
// змінну price зі значенням 22500
// змінну isSedan зі значенням true
// змінну wings зі значенням undefined
// змінну owner зі значенням null
// Примітка: використовуй ключове слово const для оголошення змінних.Наприклад, якщо потрібно оголосити змінну name зі значенням 'Ivan', це виглядатиме так:

// const name = 'Ivan';

// //--------------------===================== Result --------------------=====================
// const brand = 'Toyota';
// const price = 22500;
// const isSedan = true;
// const wings = undefined;
// const owner = null;

// ###########################################################################################################################################################

// // ==========================================Task-7

// // --------------------===================== Сonditions --------------------=====================

