// ###########################################################################################################################################################

// // ==========================================Task-1
// Доступ до багатовимірних масивів за допомогою індексів
// Багатовимірні масиви можна також описати як масиви в масивах.Коли ви використовуєте дужки для доступу до масиву, перша пара дужок відноситься до матеріалів зовнішнього(перший рівень) масиву, і кожна додаткова пара дужок стосується наступного рівня матеріалів.

//     Наприклад

// const arr = [
//     [1, 2, 3],
//     [4, 5, 6],
//     [7, 8, 9],
//     [[10, 11, 12], 13, 14]
// ];

// arr[3];
// arr[3][0];
// arr[3][0][1];
// arr[3] є[[10, 11, 12], 13, 14], arr[3][0] є[10, 11, 12], і arr[3][0][1] є 11.

// Примітка: ніколи не вставляйте пробіл між ім'ям масиву і квадратними дужками, наприклад, так array [0][0] і навіть так array [0] [0] не можна робити. Незважаючи на те, що для JavaScript це є дрібницею, ця звичка може ускладнити читання коду іншими програмістами.

// // // --------------------===================== Conditions =====================--------------------
// За допомогою квадратних дужок виберіть елемент із myArray таким чином, щоб myData дорівнював 8.

// // // --------------------===================== Result =====================--------------------

// const myArray = [
//     [1, 2, 3],
//     [4, 5, 6],
//     [7, 8, 9],
//     [[10, 11, 12], 13, 14],
// ];

// const myData = myArray[2][1];



// ###########################################################################################################################################################

// // ==========================================Task-2
// Керування масивами за допомогою push()
// Найпростіший спосіб додати дані до кінця масиву - це використати функцію push().

// .push() приймає один або більше parameters і "виштовхує" їх в кінець масиву.

//     Приклади:

// const arr1 = [1, 2, 3];
// arr1.push(4);

// const arr2 = ["Stimpson", "J", "cat"];
// arr2.push(["happy", "joy"]);
// arr1 зараз набуває значення[1, 2, 3, 4] та arr2 набуває значення["Stimpson", "J", "cat", ["happy", "joy"]].

// // // --------------------===================== Conditions =====================--------------------
Виштовхніть["dog", 3] в кінець змінної myArray.

const myArray = [["John", 23], ["cat", 2]];

// // // --------------------===================== Result =====================--------------------


























// ###########################################################################################################################################################

// // ==========================================Task-2

// // // --------------------===================== Conditions =====================--------------------

// // // --------------------===================== Result =====================--------------------









