// ###########################################################################################################################################################

// // ==========================================Task-1

// // --------------------===================== Сonditions --------------------=====================
// Давай застосуємо конкатенацію - 'склеювання' рядків через +.

// Оголоси нову змінну resultString та 'склей' з уже оголошених змінних a, b та c рядок 'Concatenation'.

//     Приклад:

// const a = 'llo';
// const b = 'He';
// const result = b + a + '!';

// // result містить рядок 'Hello!'

// // --------------------===================== Result --------------------=====================
// const a = 'Con';
// const b = 'enation';
// const c = 'cat';
// // write your code below

// const resultString = `${a + c + b}`;

// ###########################################################################################################################################################

// // ==========================================Task-1

// // --------------------===================== Сonditions --------------------=====================
// А тепер скористаємося інтерполяцією – вставкою змінних у рядок у зворотніх лапках.

// Оголоси нову змінну resultString і використай вже оголошені змінні a і b у зворотних лапках(``), щоб створити рядок:

// Hello, world!

// Зверни увагу на пробіл, кому і знак оклику, які мають бути присутні у результаті.

//     Приклад:

// const a = 'Hello';
// const result = `${a}!!!`

// // result містить рядок 'Hello!!!'

// // --------------------===================== Result --------------------=====================
// const a = 'Hello';
// const b = 'world';
// // write your code below
// const resultString = `${a}, ${b}!`;
// console.log(resultString);

