// Числа
// Найчастіше при роботі з числами ми виконуємо:

// додавання 10 + 5 = 15
// віднімання 10 - 5 = 5
// множення 10 * 5 = 50
// ділення 10 / 5 = 2
// групування(10 + 5) * 4 = 60
// зведення в ступінь 10 ** 5 = 100000
// остача від ділення 16 % 7 = 2(віднімаємо 7 поки результат не стане менше 7)
// отримати останню цифру 345 % 10 = 5(остача від ділення на 10)
// перевірити, чи є число парним 345 % 2 = 1(якщо остача 0 - число парне, якщо 1 - непарне)
// Пріоритет
// Ще зі школи ти пам'ятаєш, що множення і ділення виконуються раніше, ніж додавання. Тому 5 + 1 * 3 дорівнює 8, а не 18.

// Щоб задати правильний порядок обчислень можна скористатись дужками.Спочатку виконуються дії в дужках, а потім всі інші, і тому(5 + 1) * 3 дорівнює 18.