
// ###########################################################################################################################################################

// // ==========================================Task-1

// // --------------------===================== Сonditions --------------------=====================

// В коді є змінні a і b.

// Твоє завдання - оголосити нові змінні, які будуть виконувати основні математичні операції між a і b:

// змінна addition повинна додавати a і b;
// змінна subtraction повинна від a віднімати b;
// змінна division повинна ділити a на b;
// змінна multiplication повинна множити a на b.
//     Примітка: не змінюй значення змінних a і b і не видаляй їх!

// Приклад:

// const addition = a + b;

// // --------------------===================== Result --------------------=====================
// const a = 10;
// const b = 2;
// // write your code below this line
// let addition = a + b;
// let subtraction = a - b;
// let division = a / b;
// let multiplication = a * b;

// ###########################################################################################################################################################

// // ==========================================Task-2

// // --------------------===================== Сonditions --------------------=====================
// В коді є змінні a і b.

// Твоє завдання - оголосити нові змінні, які будуть виконувати наступні математичні операції між a і b:

// змінна exp повинна підносити a до степеня b;
// змінна mod повинна знаходити остачу від ділення a на b;
// Примітка: не змінюй значення змінних a і b і не видаляй їх!

// Підказка: використовуй оператори ** і % для виконання необхідних обчислень.

// // --------------------===================== Result --------------------=====================
// const a = 7;
// const b = 2;
// // write your code below this line
// const exp = a ** b;
// const mod = a % b;

// ###########################################################################################################################################################

// // ==========================================Task-3

// // --------------------===================== Сonditions --------------------=====================
// Постав дужки так, щоб в результаті змінна expression дорівнювала 10.

// Не оголошуй нову змінну, постав дужки в потрібних місцях у вже створеному виразі!
// // change code below
// const expression = 10 * 7 + 8 - 11 / 4;

// // --------------------===================== Result --------------------=====================
// // change code below
// const expression = 10 * ((7 + 8 - 11) / 4);